Revit 2026 API

# ElementDeleteSubelements Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool DeleteSubelements(
	IList<Subelement> subelems
)
```
```vb
Public Function DeleteSubelements (
	subelems As IList(Of Subelement)
) As Boolean
```
```cpp
public:
bool DeleteSubelements(
	IList<Subelement^>^ subelems
)
```
```fsharp
member DeleteSubelements :
        subelems : IList<Subelement> -> bool
```

#### Parameters

subelems IListSubelement

#### Return Value

Boolean

#### Reference

Element Class

Autodesk.Revit.DB Namespace